/* automatically generated by rust-bindgen 0.63.0 */

pub const OPAL_BUILD_PLATFORM_COMPILER_FAMILYID: u32 = 0;
pub const OPAL_BUILD_PLATFORM_COMPILER_VERSION: u32 = 0;
pub const OPAL_STDC_HEADERS: u32 = 1;
pub const OPAL_HAVE_ATTRIBUTE_DEPRECATED: u32 = 1;
pub const OPAL_HAVE_ATTRIBUTE_DEPRECATED_ARGUMENT: u32 = 1;
pub const OPAL_HAVE_ATTRIBUTE_ERROR: u32 = 0;
pub const OPAL_HAVE_SYS_TIME_H: u32 = 1;
pub const OPAL_HAVE_LONG_LONG: u32 = 1;
pub const OPAL_MAX_DATAREP_STRING: u32 = 128;
pub const OPAL_MAX_ERROR_STRING: u32 = 256;
pub const OPAL_MAX_INFO_KEY: u32 = 36;
pub const OPAL_MAX_INFO_VAL: u32 = 256;
pub const OPAL_MAX_OBJECT_NAME: u32 = 64;
pub const OPAL_MAX_PORT_NAME: u32 = 1024;
pub const OPAL_MAX_PROCESSOR_NAME: u32 = 256;
pub const OMPI_HAVE_FORTRAN_LOGICAL1: u32 = 1;
pub const OMPI_HAVE_FORTRAN_LOGICAL2: u32 = 1;
pub const OMPI_HAVE_FORTRAN_LOGICAL4: u32 = 1;
pub const OMPI_HAVE_FORTRAN_LOGICAL8: u32 = 1;
pub const OMPI_HAVE_FORTRAN_INTEGER1: u32 = 1;
pub const OMPI_HAVE_FORTRAN_INTEGER16: u32 = 0;
pub const OMPI_HAVE_FORTRAN_INTEGER2: u32 = 1;
pub const OMPI_HAVE_FORTRAN_INTEGER4: u32 = 1;
pub const OMPI_HAVE_FORTRAN_INTEGER8: u32 = 1;
pub const OMPI_HAVE_FORTRAN_REAL16: u32 = 1;
pub const OMPI_HAVE_FORTRAN_REAL2: u32 = 1;
pub const OMPI_HAVE_FORTRAN_REAL4: u32 = 1;
pub const OMPI_HAVE_FORTRAN_REAL8: u32 = 1;
pub const OMPI_ENABLE_MPI1_COMPAT: u32 = 1;
pub const HAVE_FLOAT__COMPLEX: u32 = 1;
pub const HAVE_DOUBLE__COMPLEX: u32 = 1;

pub const MPI_ERR_OTHER: u32 = 16;
pub const MPI_ERR_INTERN: u32 = 17;
pub const MPI_ERR_IN_STATUS: u32 = 18;
pub const MPI_ERR_PENDING: u32 = 19;
pub const MPI_ERR_ACCESS: u32 = 20;
pub const MPI_ERR_AMODE: u32 = 21;
pub const MPI_ERR_ASSERT: u32 = 22;
pub const MPI_ERR_BAD_FILE: u32 = 23;
pub const MPI_ERR_BASE: u32 = 24;
pub const MPI_ERR_CONVERSION: u32 = 25;
pub const MPI_ERR_DISP: u32 = 26;
pub const MPI_ERR_DUP_DATAREP: u32 = 27;
pub const MPI_ERR_FILE_EXISTS: u32 = 28;
pub const MPI_ERR_FILE_IN_USE: u32 = 29;
pub const MPI_ERR_FILE: u32 = 30;
pub const MPI_ERR_INFO_KEY: u32 = 31;
pub const MPI_ERR_INFO_NOKEY: u32 = 32;
pub const MPI_ERR_INFO_VALUE: u32 = 33;
pub const MPI_ERR_INFO: u32 = 34;
pub const MPI_ERR_IO: u32 = 35;
pub const MPI_ERR_KEYVAL: u32 = 36;
pub const MPI_ERR_LOCKTYPE: u32 = 37;
pub const MPI_ERR_NAME: u32 = 38;
pub const MPI_ERR_NO_MEM: u32 = 39;
pub const MPI_ERR_NOT_SAME: u32 = 40;
pub const MPI_ERR_NO_SPACE: u32 = 41;
pub const MPI_ERR_NO_SUCH_FILE: u32 = 42;
pub const MPI_ERR_PORT: u32 = 43;
pub const MPI_ERR_QUOTA: u32 = 44;
pub const MPI_ERR_READ_ONLY: u32 = 45;
pub const MPI_ERR_RMA_CONFLICT: u32 = 46;
pub const MPI_ERR_RMA_SYNC: u32 = 47;
pub const MPI_ERR_SERVICE: u32 = 48;
pub const MPI_ERR_SIZE: u32 = 49;
pub const MPI_ERR_SPAWN: u32 = 50;
pub const MPI_ERR_UNSUPPORTED_DATAREP: u32 = 51;
pub const MPI_ERR_UNSUPPORTED_OPERATION: u32 = 52;
pub const MPI_ERR_WIN: u32 = 53;
pub const MPI_T_ERR_MEMORY: u32 = 54;
pub const MPI_T_ERR_NOT_INITIALIZED: u32 = 55;
pub const MPI_T_ERR_CANNOT_INIT: u32 = 56;
pub const MPI_T_ERR_INVALID_INDEX: u32 = 57;
pub const MPI_T_ERR_INVALID_ITEM: u32 = 58;
pub const MPI_T_ERR_INVALID_HANDLE: u32 = 59;
pub const MPI_T_ERR_OUT_OF_HANDLES: u32 = 60;
pub const MPI_T_ERR_OUT_OF_SESSIONS: u32 = 61;
pub const MPI_T_ERR_INVALID_SESSION: u32 = 62;
pub const MPI_T_ERR_CVAR_SET_NOT_NOW: u32 = 63;
pub const MPI_T_ERR_CVAR_SET_NEVER: u32 = 64;
pub const MPI_T_ERR_PVAR_NO_STARTSTOP: u32 = 65;
pub const MPI_T_ERR_PVAR_NO_WRITE: u32 = 66;
pub const MPI_T_ERR_PVAR_NO_ATOMIC: u32 = 67;
pub const MPI_ERR_RMA_RANGE: u32 = 68;
pub const MPI_ERR_RMA_ATTACH: u32 = 69;
pub const MPI_ERR_RMA_FLAVOR: u32 = 70;
pub const MPI_ERR_RMA_SHARED: u32 = 71;
pub const MPI_T_ERR_INVALID: u32 = 72;
pub const MPI_T_ERR_INVALID_NAME: u32 = 73;
pub const MPI_ERR_LASTCODE: u32 = 92;
pub const MPI_TYPECLASS_INTEGER: u32 = 1;
pub const MPI_TYPECLASS_REAL: u32 = 2;
pub const MPI_TYPECLASS_COMPLEX: u32 = 3;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type MPI_Aint = isize;
pub type MPI_Offset = ::std::os::raw::c_longlong;
pub type MPI_Count = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_communicator_t {
    _unused: [u8; 0],
}
pub type MPI_Comm = *mut ompi_communicator_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_datatype_t {
    _unused: [u8; 0],
}
pub type MPI_Datatype = *mut ompi_datatype_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_errhandler_t {
    _unused: [u8; 0],
}
pub type MPI_Errhandler = *mut ompi_errhandler_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_file_t {
    _unused: [u8; 0],
}
pub type MPI_File = *mut ompi_file_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_group_t {
    _unused: [u8; 0],
}
pub type MPI_Group = *mut ompi_group_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_info_t {
    _unused: [u8; 0],
}
pub type MPI_Info = *mut ompi_info_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_op_t {
    _unused: [u8; 0],
}
pub type MPI_Op = *mut ompi_op_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_request_t {
    _unused: [u8; 0],
}
pub type MPI_Request = *mut ompi_request_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_message_t {
    _unused: [u8; 0],
}
pub type MPI_Message = *mut ompi_message_t;
pub type MPI_Status = ompi_status_public_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_win_t {
    _unused: [u8; 0],
}
pub type MPI_Win = *mut ompi_win_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mca_base_var_enum_t {
    _unused: [u8; 0],
}
pub type MPI_T_enum = *mut mca_base_var_enum_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_mpit_cvar_handle_t {
    _unused: [u8; 0],
}
pub type MPI_T_cvar_handle = *mut ompi_mpit_cvar_handle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mca_base_pvar_handle_t {
    _unused: [u8; 0],
}
pub type MPI_T_pvar_handle = *mut mca_base_pvar_handle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mca_base_pvar_session_t {
    _unused: [u8; 0],
}
pub type MPI_T_pvar_session = *mut mca_base_pvar_session_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_status_public_t {
    pub MPI_SOURCE: ::std::os::raw::c_int,
    pub MPI_TAG: ::std::os::raw::c_int,
    pub MPI_ERROR: ::std::os::raw::c_int,
    pub _cancelled: ::std::os::raw::c_int,
    pub _ucount: usize,
}
#[test]
fn bindgen_test_layout_ompi_status_public_t() {
    const UNINIT: ::std::mem::MaybeUninit<ompi_status_public_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ompi_status_public_t>(),
        24usize,
        concat!("Size of: ", stringify!(ompi_status_public_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ompi_status_public_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ompi_status_public_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MPI_SOURCE) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_status_public_t),
            "::",
            stringify!(MPI_SOURCE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MPI_TAG) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_status_public_t),
            "::",
            stringify!(MPI_TAG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MPI_ERROR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_status_public_t),
            "::",
            stringify!(MPI_ERROR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cancelled) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_status_public_t),
            "::",
            stringify!(_cancelled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ucount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_status_public_t),
            "::",
            stringify!(_ucount)
        )
    );
}
pub type MPI_Datarep_extent_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: MPI_Datatype,
        arg2: *mut MPI_Aint,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Datarep_conversion_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: MPI_Datatype,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_void,
        arg5: MPI_Offset,
        arg6: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Comm_errhandler_function = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut MPI_Comm, arg2: *mut ::std::os::raw::c_int, ...),
>;
pub type ompi_file_errhandler_fn = ::std::option::Option<
